Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: Possible performance issues
sv: Möjliga prestandaproblem

source: While requesting new chart data the server returned an invalid response. This is most likely because your session expired. Reloading the page and reentering your credentials should help.
sv: När ny diagramdata begärdes, returnerade servern ett ogiltigt svar. Detta beror troligen på att din session har upphört. Om du laddar om sidan och matar in dina inloggningsuppgifter igen borde det lösa problemet.

source: Enable Zero Configuration mode
sv: Aktivera "Zero Configuration" läge

source: Results are grouped by query text.
sv: Resultaten grupperas efter frågetext.

source: The number of queries added to the cache.
sv: Antalet förfrågningar tillagda i cachen.

source: Table comments
sv: Tabellkommentarer

source: Step
sv: Steg

source: User:
sv: Användare:

source: From slow log
sv: Från långsam logg

source: Configuration already exists, setup is disabled!
sv: Konfigurationen finns redan, installation är inaktiverad.

source: Lines terminated with
sv: Rader avslutas med

source: Display logo
sv: Visa logo

source: Table %s has been copied to %s.
sv: Tabellen %s har kopierats till %s.

source: B
sv: bytes

source: Allows altering the structure of existing tables.
sv: Tillåter ändring av befintliga tabellers struktur.

source: Have a primary key
sv: Har en primär nyckel

source: Please enter a valid credit card number
sv: Skriv in ett giltigt kreditkortsnummer

source: %d row affected by the last statement inside the procedure.
sv: %d rad berörs av det sista uttrycket inom proceduren.

source: %d rows affected by the last statement inside the procedure.
sv: %d rader berörs av det sista uttrycket inom proceduren.

source: Show unformatted values
sv: Visa oformaterade värden

source: Lithuanian
sv: Litauisk

source: Constraint name
sv: Begränsningsnamn

source: Paper size
sv: Pappersstorlek

source: Choose from which log you want the statistics to be generated from.
sv: Välj vilken logg du vill att statistiken ska genereras från.

source: Add ON DUPLICATE KEY UPDATE
sv: Lägg till DUBLETTNYCKEL

source: The size of the global transaction log buffer (the engine allocates 2 buffers of this size). The default is 1MB.
sv: Storleken på den globala transaktionsloggbuffern (motorn allokerar 2 buffrar med denna storlek). Standardvärdet är 1MB.

source: Configuration file
sv: Konfigurationsfil

source: SQL Query
sv: SQL-fråga

source: Skip tables larger than:
sv: Hoppa över tabeller större än:

source: End of line
sv: Radslut

source: Basic settings
sv: Grundläggande inställningar

source: Verify
sv: Verifiera

source: Disable the default warning that is displayed on the main page if the value of the PHP setting session.gc_maxlifetime is less than the value of `LoginCookieValidity`.
sv: Inaktivera standard varningen som visas på huvudsidan om värdet av PHP inställningen session.gc_maxlifetime är mindre än värdet för 'LoginCookieValidity'.

source: If using [kbd]cookie[/kbd] authentication and %sLogin cookie store%s is not 0, %sLogin cookie validity%s must be set to a value less or equal to it.
sv: Om du använder [kbd]cookie[/kbd] -autentisering och %sLogin cookie store%s inte är 0, måste %sLogin cookie validity%s sättas till ett värde mindre eller lika med den.

source: Server running with Suhosin. Please refer to %sdocumentation%s for possible issues.
sv: Server körs med Suhosin. Se %sdokumentation%s för möjliga problem.

source: Access denied!
sv: Åtkomst nekad!

source: Stores vector data optimized for operations such as similarity search and machine learning applications
sv: Lagrar vektordata optimerade för åtgärder som likhetssökning och maskininlärningsprogram

source: This server is not configured as primary in a replication process. Would you like to %sconfigure%s it?
sv: Den här servern är inte konfigurerad som primär i en replikeringsprocess. Vill du %skonfigurera%s den?

source: log_slow_queries is set to 'OFF'
sv: log_slow_queries är satt till 'OFF'

source: Select table:
sv: Välj tabell:

source: Please enter a valid hexadecimal string. Valid characters are 0-9, A-F.
sv: Ange en giltig hexadecimal sträng. Giltiga tecken är 0-9, A-F.

source: Coalesce
sv: Sammanfogning

source: The primary key has been dropped.
sv: Den primära nyckeln har tagits bort.

source: Series column:
sv: Kolumnserie:

source: Table %1$s has been renamed to %2$s.
sv: Tabell %1$s har döpts om till %2$s.

source: phpMyAdmin tried to connect to the MySQL server, and the server rejected the connection. You should check the host, username and password in your configuration and make sure that they correspond to the information given by the administrator of the MySQL server.
sv: phpMyAdmin försökte skapa en förbindelse till MySQL-servern, men servern nekade uppkopplingen. Kontrollera värd, användarnamn och lösenord i din konfiguration och förvissa dig om att de stämmer överens med informationen från administratören av MySQL-servern.

source: Get more themes!
sv: Hämta fler teman!

source: View structure
sv: Visningsstruktur

source: Navigation tree
sv: Navigationsträd

source: The number of open files is approaching the max number of open files. You may get a "Too many open files" error.
sv: Antalet öppna filer närmar sig maximalt antal öppna filer. Du kan få ett "För många öppna filer"-fel.

source: Using the monitor:
sv: Använda monitorn:

source: How many temporary files mysqld has created.
sv: Antalet temporära filer som mysqld har skapat.

source: No files available on server for import!
sv: Inga filer tillgängliga för import på servern!

source: Trigger %1$s has been created.
sv: Triggern %1$s har skapats.

source: An error has been detected and an error report has been generated but failed to be sent.
sv: Ett fel har upptäckts och en felrapport har skapats men kunde inte skickas.

source: The number of rows deleted from InnoDB tables.
sv: Antalet rader borttagna från InnoDB-tabeller.

source: from %s branch
sv: från grenen %s

source: Invalid table name:
sv: Ogiltigt tabellnamn:

source: unavailable
sv: otillgänglig

source: You have enabled two factor authentication.
sv: Du har aktiverat tvåfaktorsautentisering.

source: Persistent favorite tables:
sv: Beständiga favorittabeller:

source: Change report settings
sv: Ändra rapportinställningar

source: Sorry, we failed to restore the dropped routine.
sv: Tyvärr, vi lyckades inte återställa den slängda rutinen.

source: The imported file does not contain any data!
sv: Den importerade filen innehåller inte några data!

source: Syntax highlighted CodeMirror editor for XML (and HTML).
sv: Syntax CodeMirror editor för XML (och HTML).

source: Leave blank for no column comments/media types, suggested: [kbd]pma__column_info[/kbd].
sv: Lämna tomt för att stänga av kolumnkommentarer/MIME-typer, förslag: [kbd]pma__column_info[/kbd].

source: A 4-byte integer, signed range is -2,147,483,648 to 2,147,483,647, unsigned range is 0 to 4,294,967,295
sv: Ett 4-bytes heltal, signerat inom intervallet -2147483648 till 2147483647, osignerat inom intervallet 0 till 4294967295

source: Received
sv: Mottagna

source: Parameters
sv: Parametrar

source: Dropping Primary Key/Index
sv: Tar bort Primär Nyckel/Index

source: %d minute
sv: %d minut

source: You set the [kbd]config[/kbd] authentication type and included username and password for auto-login, which is not a desirable option for live hosts. Anyone who knows or guesses your phpMyAdmin URL can directly access your phpMyAdmin panel. Set %1$sauthentication type%2$s to [kbd]cookie[/kbd] or [kbd]http[/kbd].
sv: Du har valt autentiseringstypen [kbd]config[/kbd] och angett användarnamn och lösenord för automatisk inloggning, vilket inte lämpar sig för produktionsservrar. Alla som känner till eller gissar din phpMyAdmin-URL kan komma åt din phpMyAdmin-panel direkt. Ange %1$sautentiseringstyp%2$s till [kbd]cookie[/kbd] eller [kbd]http[/kbd].

source: User name
sv: Användarnamn

source: Polish
sv: Polsk

source: Welcome to %s
sv: Välkommen till %s

source: @SERVER@ will become the server name, @DATABASE@ will become the database name and @TABLE@ will become the table name.
sv: @SERVER@ blir servernamnet, @DATABASE@ blir databasnamnet och @TABLE@ blir tabellnamnet.

source: Length/Values
sv: Längd/Värden

source: The % of indexes that use the MyISAM key buffer is low.
sv: Andelen index som använder MyISAM-nyckelbufferten är låg.

source: Success
sv: Lyckades

source: Start SQL Thread only
sv: Starta endast SQL-tråd

source: Foreign key constraint
sv: Begränsning av främmande nyckel

source: Disable the default warning that is displayed on the main page if Suhosin is detected.
sv: Stäng av varning om att Suhosin upptäcks.

source: Template was updated.
sv: Mallen uppdaterades.

source: A curve with linear interpolation between points
sv: En kurva med linjär interpolering mellan punkter

source: Whether to show views under database in the navigation tree
sv: Om du vill visa vyer från databasen i navigationsträdet

source: Please enter the SQL query first.
sv: Skriv in SQL-frågan först.

source: Data length
sv: Datalängd

source: Chart title:
sv: Diagramtitel

source: Tracked tables
sv: Spårade tabeller

source: Data file grow size
sv: Växstorlek för datafil

source: Please enter a valid number
sv: Var vänlig ange ett giltigt nummer

source: Truncate table before insert
sv: Trunkera tabell innan inläggning

source: Search:
sv: Sök:

source: Warning
sv: Varning

source: Kill
sv: Döda

source: Collapse
sv: Slå ihop

source: Press Ctrl+Enter to execute query
sv: Tryck på Ctrl+Enter för att exekvera frågan

source: There are too many threads that are slow to launch.
sv: Det är för många trådar som tar lång tid att starta.

source: Use text field
sv: Använd textfältet

source: Numeric
sv: Numeriska

source: Following composer packages are missing:
sv: Följande Composer-paket saknas:

source: Hardware Security Key (WebAuthn/FIDO2)
sv: Maskinvarusäkerhetsnyckel (WebAuthn/FIDO2)

source: '%s' database does not exist.
sv: Databasen '%s' existerar inte.

source: State
sv: Tillstånd

source: Column minimum:
sv: Minsta kolumn:

source: ESRI Shape File
sv: ESRI Shape-fil

source: Secret/key:
sv: Hemlighet/nyckel:

source: Metadata for table %s
sv: Metadata för tabellen %s

source: Sun
sv: Sön

source: Show form
sv: Visa formulär

source: Internal relationship has been removed.
sv: En intern relation har tagits bort.

source: Wrong permissions on configuration file, should not be world writable!
sv: Fel behörigheter på konfigurationsfilen, bör inte vara "world" skrivbar!

source: Copy database to
sv: Kopiera databasen till

source: Jump to Log table
sv: Gå till tabellogg

source: Optimize partition
sv: Optimera partition

source: Ignoring unsupported language code.
sv: Ignorera kod från icke-supportrade språk.

source: Whether a user should be displayed a "show all (rows)" button.
sv: Ifall en användare ska få se en "visa alla (rader)"-knapp.

source: The query cache size is above 128 MiB. Big query caches may cause significant overhead that is required to maintain the cache.
sv: Storleken på frågecache är större än 128 Mb. Stor frågecache kan orsaka betydande overhead, vilket krävs för att behålla cache.

source: Select binary log to view
sv: Välj binär logg att visa

source: Percentage of index reads from memory
sv: Andelen index som läses från minnet

source: MySQL is not compiled as a 64-bit package.
sv: MySQL är inte kompilerad som ett 64-bitars paket.

source: Enable Zero Configuration mode which lets you set up phpMyAdmin configuration storage tables automatically.
sv: Aktivera nollkonfigurationsläget, som låter dig konfigurera phpMyAdmins tabeller för konfigurationslagring automatiskt.

source: Uptime is less than 1 day, performance tuning may not be accurate.
sv: Upptid är mindre än en dag, prestandajustering kanske inte är korrekt.

source: Please connect your FIDO U2F device into your computer's USB port. Then confirm login on the device.
sv: Anslut FIDO U2F-enheten till datorns USB-port. Bekräfta sedan inloggningen på enheten.

source: Defines how long (in seconds) a login cookie should be stored in browser. The default of 0 means that it will be kept for the existing session only, and will be deleted as soon as you close the browser window. This is recommended for non-trusted environments.
sv: Anger hur lång tid (i sekunder) som en inloggnings-cookie ska lagras i webbläsaren. Standardvärdet 0 innebär att den sparas endast under befintlig session, och kommer tas bort så snart webbläsaren stängs. Detta är rekommenderat för icke tillförlitliga miljöer.

source: Add %s
sv: Lägg till %s

source: Failed to get real row count.
sv: Det gick inte att få riktiga radantal.

source: List of trusted proxies for IP allow/deny
sv: Lista med betrodda proxies för IP allow/deny

source: This column can not contain a 32 chars value
sv: Den här kolumnen kan inte innehålla ett värde med 32 tecken

source: Time taken:
sv: Tidsåtgång:

source: concurrent_insert is set to 0
sv: concurrent_insert är satt till 0

source: Can't move table to same one!
sv: Kan inte flytta tabell till samma en!

source: A single value chosen from a set of up to 64 members
sv: En enstaka värde valt från en uppsättning av upp till 64 stycken

source: Transaction coordinator
sv: Transaktionssamordnare

source: Binary log
sv: Binär logg

source: Tracking is active.
sv: Spårning är aktiv.

source: Table structure
sv: Tabellstruktur

source: per second
sv: per sekund

source: When disabled, users cannot set any of the options below, regardless of the checkbox on the right.
sv: När det är avstängt, kan användare inte ange något av alternativen nedan, oberoende av kryssrutan till höger.

source: Data pointer size
sv: Storlek för datapekare

source: Busy pages
sv: Upptagna sidor

source: Succeeded
sv: Lyckades

source: Allows deleting data.
sv: Tillåter borttagning av data.

source: Image upload functionality which also displays a thumbnail. The options are the width and height of the thumbnail in pixels. Defaults to 100 X 100.
sv: Bild belastar uppladdningsfunktion. Alternativen är bredden och höjden på miniatyren i pixlar. Standard 100X100.

source: Enter your public key for the reCAPTCHA service on your domain.
sv: Ange din publika nyckel för reCAPTCHA-tjänsten på domänen.

source: Table navigation bar
sv: Tabellbaserat navigeringsfält

source: Update bookmark
sv: Uppdatera bokmärke

source: Whether a DROP DATABASE IF EXISTS statement will be added as first line to the log when creating a database.
sv: Om DROP DATABASE IF EXISTS-kommando skall läggas till som första raden i loggen när man skapar en databas.

source: Remove redundant columns
sv: ﻿Ta bort överflödiga kolumner

source: Last update:
sv: Senaste uppdatering:

source: Add %s column(s) to index
sv: Lägg till %s kolumn(er) till index

source: Write waits in %
sv: Skrivväntanden i %

source: Replication stopped successfully.
sv: Replikering stoppades framgångsrikt.

source: %s%% of all clients are aborted. This value should be below 2%%
sv: %s%% av alla klienter har avslutats. Detta värde bör vara under 2%%

source: Skip this number of queries (for SQL) starting from the first one:
sv: Hoppa över detta antal frågor (för SQL) räknat från den första:

source: Buffer pool size
sv: Buffertstorlek

source: Please select the file you want to import:
sv: Välj den fil du vill importera:

source: Wildcards % and _ should be escaped with a \ to use them literally.
sv: Jokertecknen _ och % måste föregås av ett \ för att användas i egentlig betydelse.

source: Columns terminated with
sv: Kolumner avslutas med

source: Linestring %d:
sv: Linjesträng %d:

source: Too many error messages, some are not displayed.
sv: För många felmeddelanden, en del kommer inte visas.

source: You don't have sufficient privileges to perform this operation; Please refer to the documentation for more details.
sv: Du har inte tillräcklig behörighet att utföra åtgärden. Se dokumentationen för mer information.

source: Actions
sv: Åtgärder

source: About %SEC sec. remaining.
sv: Ungefär %SEC sek. återstår.

source: Export of routine %s
sv: Exportera rutin %s

source: Enable autocomplete for table and column names
sv: Aktivera "auto-fyll" för tabell-och kolumnnamn

source: Error while moving uploaded file.
sv: Fel vid flytt av uppladdad fil.

source: Show PHP information
sv: Visa PHP-information

source: Reset to default
sv: Återställ till standardinställningen

source: Not enough privilege to view users.
sv: Inte tillräckligt privilegier för att visa användare.

source: CREATE DATABASE before copying
sv: CREATE DATABASE före kopiering

source: MySQL Spatial Extension does not support ESRI type "%s".
sv: MySQL Spatial Extension stöder inte ESRI-typen "%s".

source: Navigation panel
sv: Navigationspanel

source: Allows creating and dropping triggers.
sv: Tillåter skapande och borttagning av triggers.

source: The server is not responding (or the local server's socket is not correctly configured).
sv: Servern svarar inte (eller den lokala serverns socket är inte korrekt konfigurerad).

source: Select up to what step you want to normalize
sv: Välj till vilket steg du vill normalisera

source: descending
sv: fallande

source: have_innodb is set to 'value'
sv: have_innodb är satt till "value"

source: Advisor
sv: Handledare

source: <code>INSERT DELAYED</code> statements
sv: <code>INSERT DELAYED</code>-kommandon

source: An account already exists with the same username but possibly a different hostname.
sv: Ett konto existerar redan med samma användarnamn men möjligen ett annat värdnamn.

source: The table name is empty!
sv: Tabellnamnet är tomt!

source: Failed calculating value for rule '%s'.
sv: Det gick inte att beräkna värdet för regeln '%s'.

source: Pin text
sv: Fäst texter

source: Checkpoint frequency
sv: Frekvens för kontrollpunkt

source: Edit settings for %s
sv: Redigera inställningar för %s

source: Log file count
sv: Antal loggfiler

source: Failed to connect to the reCAPTCHA service!
sv: Det gick inte att ansluta till reCAPTCHA-tjänsten!

source: Tracking report for table `%s`
sv: Spårning av rapport för tabell `%s`

source: English
sv: Engelsk

source: The primary key ( %1$s ) consists of more than one column so we need to find the partial dependencies.
sv: Primärnyckeln (%1$s) består av mer än en kolumn så vi måste hitta de partiella beroendena.

source: No repeating group
sv: Ingen upprepande grupp

source: Replace
sv: Ersatt

source: Label
sv: Etikett

source: Title of browser window when a database is selected.
sv: Titel på webbläsarfönstret när en databas är vald.

source: Thread cache hit rate %
sv: Trådcachens träffrekvens: %

source: The number of sequential read-aheads InnoDB initiated. This happens when InnoDB does a sequential full table scan.
sv: Antalet sekventiella läsningar i förväg som InnoDB initierat. Detta sker när InnoDB gör en sekventiell avsökning av en hel tabell.

source: Column %s has been dropped.
sv: Kolumnen %s har tagits bort.

source: Thursday
sv: Torsdag

source: Russian
sv: Rysk

source: Thread cache is disabled, resulting in more overhead from new connections to MySQL.
sv: Trådad cache är inaktiverad, vilket resulterar i mer overhead från nya anslutningar till MySQL.

source: Maximum size for temporary files on index creation
sv: Maximal storlek för temporära filer vid skapande av index

source: For each column below, please select the <b>minimal set</b> of columns among given set whose values combined together are sufficient to determine the value of the column.<br>Note: A column may have no transitive dependency, in that case you don't have to select any.
sv: För varje kolumn nedan, Välj <b>minimal uppsättning</b> kolumner av givna värden vilka kombinerade ihop är tillräckliga för att fastställa värdet i kolumn. <br> Obs: om kolumn inte har transitiva beroende behöver du inte välja något.

source: Allow login to any MySQL server
sv: Tillåt inloggning till valfri MySQL-server

source: Table space
sv: Tabellutrymme

source: Threads that are slow to launch
sv: Trådar som är långsamma att starta

source: Please enter a value less than or equal to {0}
sv: Ange ett värde som är mindre än eller lika med {0}

source: Structure and data
sv: Struktur och data

source: Bytes received
sv: Antal mottagna bital

source: It is suggested to set {long_query_time} to a lower value, depending on your environment. Usually a value of 1-5 seconds is suggested.
sv: Det rekommenderas att sätta {long_query_time} till ett lägre värde, beroende på din miljö. Ett värde på 1-5 sekunder är lämpligt.

source: Column names:
sv: Kolumnnamn:

source: Default transformations for Substring
sv: Standardomvandlingar för delsträngar

source: Progress
sv: Framsteg

source: You may examine the data in the error report:
sv: Du kan undersöka data i felrapporten:

source: Please check privileges of directory containing database.
sv: Kontrollera privilegierna för katalogen som innehåller databasen.

source: Inner ring %d:
sv: Inre ring %d:

source: Sinhalese
sv: Singalesisk

source: database-specific
sv: databasspecifik

source: Table alias
sv: Tabellalias

source: Successfully deleted the page
sv: Raderingen av sidan lyckades

source: Build Query
sv: Bygg sökfråga

source: Questions since startup:
sv: Frågor sedan start:

source: There are no files to import!
sv: Det finns inga filer att importera!

source: Edit next row
sv: Ändra nästa rad

source: Language
sv: Språk

source: Please enter a value greater than or equal to {0}
sv: Ange ett värde större än eller lika med {0}

source: Drag to reorder
sv: Dra om du vill ändra ordning

source: Table to describe the display columns, leave blank for no support; suggested: [kbd]pma__table_info[/kbd].
sv: Tabell för att beskriva visningskolumnerna, lämna tomt för avstängt stöd; förslag: [kbd]pma__table_info[/kbd].

source: Order of the tables
sv: Tabellordning

source: The number of times that a table lock was acquired immediately.
sv: Antalet gånger som ett tabellås förvärvades omedelbart.

source: Export of event %s
sv: Exportera händelse %s

source: Enable foreign key checks
sv: Aktivera kontroll av främmande nycklar

source: Input proxies as [kbd]IP: trusted HTTP header[/kbd]. The following example specifies that phpMyAdmin should trust a HTTP_X_FORWARDED_FOR (X-Forwarded-For) header coming from the proxy 1.2.3.4:[br][kbd]1.2.3.4: HTTP_X_FORWARDED_FOR[/kbd].
sv: Ange proxy som [kbd]IP: trusted HTTP header[/kbd]. I följande exempel anges att phpMyAdmin bör lita på ett HTTP_X_FORWARDED_FOR (X-Forwarded-For)-huvud som kommer från proxyservern 1.2.3.4:[br][kbd]1.2.3.4: HTTP_X_FORWARDED_FOR[/kbd].

source: Delete pages
sv: Ta bort sidor

source: Unlock this account.
sv: Lås upp det här kontot.

source: %1$sLogin cookie validity%2$s greater than %3$ssession.gc_maxlifetime%4$s may cause random session invalidation (currently session.gc_maxlifetime is %5$d).
sv: %1$sGiltighetstid för inloggningskakan%2$s som är längre än %3$ssession.gc_maxlifetime%4$s kan leda till att sessioner ogiltigförklaras slumpmässigt (session.gc_maxlifetime är för närvarande %5$d).

source: Character set of the file
sv: Filens teckenuppsättning

source: Add new column
sv: Lägg till ny kolumn

source: Number of rows displayed when browsing a result set. If the result set contains more rows, "Previous" and "Next" links will be shown.
sv: Antal rader som visas vid visning av resultat. Om resultatet innehåller fler rader, visas länkar för "Föregående" och "Nästa".

source: Custom - display all possible options to configure
sv: Anpassad - visa alla tillgängliga konfigurationsalternativ

source: Third step of normalization (3NF)
sv: Tredje steget i normalisering (3NF)
